from functions import (
    euclid_extended,
    comparison_x1,
    comparison_system,
    comparison_x2
)

#####################################################
######### Контрольная работа 2. Вариант №3. #########
#####################################################

##################### Задание 1 #####################
# Вычислить 1137^(−1) (mod 2577)
#####################################################
euclid_extended(a=2577, b=1137)

##################### Задание 2 #####################
# Решить систему уравнений: x ≡ b (mod m)
# x ≡ 7 (mod 15)
# x ≡ 19 (mod 22)
# x ≡ 16 (mod 19)
#####################################################
equations = [{"b": 7, "m": 15}, {"b": 19, "m": 22}, {"b": 16, "m": 19}]
comparison_system(equations)

##################### Задание 3 #####################
# Решить сравнение 196𝑥 ≡ 329 (mod 1253)
#####################################################
comparison_x1(a=196, b=329, m=1253)

##################### Задание 4 #####################
# Решить сравнение x^2 ≡ 420 (mod 1049)
#####################################################
comparison_x2(a=420, p=1049)